InformationRegisters/НастройкиУчетаВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчитыватьНочныеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВечерниеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесколькоВидовПлановогоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВремяНаКормлениеРебенка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьСоответствиеФактическогоВремениПлановому</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьЧасыВДеньНачалаСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРежимыРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСменыРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУчетаВремени/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗаписи = (Количество() > 0 И Не РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение));
	
	ПодсистемаСуществует = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы");
	Если Не ПодсистемаСуществует Тогда
		Если ЕстьЗаписи И (ЭтотОбъект[0].ИспользоватьСменыРаботы Или ЭтотОбъект[0].ИспользоватьРежимыРаботы) Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя установить значения настроек ИспользоватьСменыРаботы и ИспользоватьРежимыРаботы'");
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьЗаписи И ЭтотОбъект[0].ИспользоватьСменыРаботы Тогда
		ЭтотОбъект[0].ИспользоватьРежимыРаботы = Истина;
	КонецЕсли;
	
	ПредыдущиеЗначенияНастроекУчетаВремени = УчетРабочегоВремениРасширенный.НастройкиУчетаВремени();
	
	ДополнительныеСвойства.Вставить("ПредыдущиеЗначенияНастроекУчетаВремени", ПредыдущиеЗначенияНастроекУчетаВремени);
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияНастроекУчетаВремени = УчетРабочегоВремениРасширенный.НастройкиУчетаВремени();
	ПредыдущиеЗначенияНастроекУчетаВремени = Неопределено;
	ДополнительныеСвойства.Свойство("ПредыдущиеЗначенияНастроекУчетаВремени", ПредыдущиеЗначенияНастроекУчетаВремени);
		
	Если ЗначенияНастроекУчетаВремени.ИспользоватьСменыРаботы Тогда
		Если ПредыдущиеЗначенияНастроекУчетаВремени = Неопределено 
			Или Не ПредыдущиеЗначенияНастроекУчетаВремени.ИспользоватьСменыРаботы Тогда
			
			Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказательОтработаноСмен();
		КонецЕсли;	
	Иначе	
		Если ПредыдущиеЗначенияНастроекУчетаВремени <> Неопределено
			И ПредыдущиеЗначенияНастроекУчетаВремени.ИспользоватьСменыРаботы Тогда
			
			Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПоказателяОтработаноСмен();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
